---
type: PlanViewRange
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# PlanViewRange

`Autodesk.Revit.DB.PlanViewRange` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetLevelId | 2013 | `public ElementId GetLevelId ( PlanViewPlane planViewPlane )` |
| Method | GetOffset | 2013 | `public double GetOffset ( PlanViewPlane planViewPlane )` |
| Method | SetLevelId | 2013 | `public void SetLevelId ( PlanViewPlane planViewPlane , ElementId id )` |
| Method | SetOffset | 2013 | `public void SetOffset ( PlanViewPlane planViewPlane , double offset )` |
| Property | Current | 2013 | `public static ElementId Current { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LevelAbove | 2013 | `public static ElementId LevelAbove { get ; }` |
| Property | LevelBelow | 2013 | `public static ElementId LevelBelow { get ; }` |
| Property | Unlimited | 2013 | `public static ElementId Unlimited { get ; }` |